2024/02/02/the-conniver-reference-manual/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>The CONNIVER reference manual | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display%7CTangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Friday 2 February, 2024</a>
	    </span>
	</div>
	<h1>The <span class="caps">CONNIVER</span> reference&nbsp;manual</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orgc6e0b54" class="outline-2">
<h2 id="orgc6e0b54">The <span class="caps">CONNIVER</span> reference&nbsp;manual</h2>
<div class="outline-text-2" id="text-orgc6e0b54">
<p>
Drew McDermott and Gerald Jay Sussman.  <i><a href="https://dspace.mit.edu/handle/1721.1/6204">The Conniver Reference
Manual</a></i>. Technical report <span class="caps">AIM</span>-259a. <span class="caps">MIT</span> <span class="caps">AI</span> Laboratory.&nbsp;1974.
</p>

<p>
I think Conniver may have a claim to being the most influential
language you&#8217;ve never heard of. It&#8217;s a mostly forgotten Lisp
variant that was a laboratory for some radically different
language design ideas, and a precursor to a surprising set of
features – many of which are still uncommon in the&nbsp;mainstream.
</p>

<p>
Conniver was intended to manage knowledge databases. This does
make the report slightly hard to read in places, as there are a
lot of explicit references to planning techniques wrapped-up with
language mechanisms that don&#8217;t really depend on&nbsp;them.
</p>

<p>
Conniver is (to the best of my knowledge) the first appearance of
<b>generators</b> in a programming language. It is therefore a distant
precursor of all the lazy functional languages and libraries, as
well as the generators found in Python. Implementing generators
<i>within</i> a language (rather than as a built-in part of one)
requires control structures that can be exited and re-entered, and
therefore needs more flexible frames for controlling executing
code rather than conventional stack frames that are unwound
destructively on&nbsp;return.
</p>

<p>
The obvious (for Lisp, anyway) next step is to make these &#8220;hairy&#8221;
control structures visible within the language, to allow them to
be re-arranged in interesting ways. It does this by exposing the
structure of frames, consisting&nbsp;of:
</p>

<ul class="org-ul">
<li>the bound&nbsp;variables</li>
<li>the state of the ongoing computation within the frame (<i>e.g.</i>,
the program&nbsp;counter)</li>
<li>a link&nbsp;(the <code>ALINK</code>) to the frame within which free variables
should be&nbsp;looked-up</li>
<li>a link&nbsp;(the <code>CLINK</code>) to the frame to which control should return
on exit from the&nbsp;frame</li>
</ul>
<p>
This structure in turn mandates the use of <b>spaghetti stack</b> (or
<a href="https://en.wikipedia.org/wiki/Parent_pointer_tree">parent pointer trees</a>) where frames are implemented using lists
that can be combined in richer ways than actual, literal stacks.
Thee are the underpinnings of several different common&nbsp;structures:
</p>

<ul class="org-ul">
<li>generators and&nbsp;continuations</li>
<li>closures</li>
<li>non-local transfers,&nbsp;like <code>CATCH</code> and <code>THROW</code> in Common Lisp, and
therefore probably encompassing the entire condition&nbsp;system</li>
<li>functions with access to extra state (as with object methods,
but in this case used as callbacks for database&nbsp;updates)</li>
<li>symbolic debuggers (not mentioned in the&nbsp;text)</li>
<li>lexical <i>versus</i> dynamic variable scope (not mentioned in the
text, and I think it&#8217;s a binary choice between one or the other
depending on&nbsp;the <code>ALINK</code>, rather than accommodating lexical and
&#8220;special&#8221; variable classes as Common Lisp&nbsp;does)</li>
</ul>
<p>
So these features are constructed in Conniver from more basic
mechanisms rather than being provided built-in. I&#8217;m fascinated by
what other structures one might build when every frame has <i>two</i>
independent super-frames (one for variable lookup,one for control
return) instead of one, and both can be modified independently.
This is radically different to most languages in which frames are
hidden and their manipulation reserved for the compiler and
run-time: it&#8217;s a set of ideas that re-surface at the object level
in metaobject&nbsp;protocols.
</p>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->
  <div class="site-content">
    <div class="social">
      <ul>
<li><a onclick="MastodonShare(this);" data-src="The%20CONNIVER%20reference%20manual%20%23language-reference%20%23lisp%20%23project%3Alisp-bibliography&amp;url=https://simondobson.org/2024/02/02/the-conniver-reference-manual/"><span title="Share on Mastodon"><i class="fab fa-mastodon"></i></span></a></li>
	<li><a href="https://twitter.com/share?text=The%20CONNIVER%20reference%20manual%20%23language-reference%20%23lisp%20%23project%3Alisp-bibliography&amp;url=https://simondobson.org/2024/02/02/the-conniver-reference-manual/" target="_blak"><span title="Share on Twitter"><i class="fab
	fa-twitter"></i></span></a></li>
	<li><a href="https://www.reddit.com/submit?url=https://simondobson.org/2024/02/02/the-conniver-reference-manual/&amp;title=The%20CONNIVER%20reference%20manual%20%23language-reference%20%23lisp%20%23project%3Alisp-bibliography" target="_blank"><span title="Share on Reddit"><i class="fab fa-reddit"></i></span></a></li>
	<li><a href="https://www.linkedin.com/shareArticle?url=https://simondobson.org/2024/02/02/the-conniver-reference-manual/&amp;source=https://simondobson.org/" target="_blank"><span title="Share on LinkedIn"><i class="fab fa-linkedin"></i></span></a></li>
	<li><a href="mailto:?subject=The%20CONNIVER%20reference%20manual&amp;body=https://simondobson.org/2024/02/02/the-conniver-reference-manual/"><span title="Share by email"><i class="fa fa-envelope"></i></span></a></li>
      </ul>
</div>
  </div>

	<!-- Tag Section -->
    <div class="site-content navigation-post">
	<div class="tag-head">Tags</div>
	<div class="tag-list">
		<a href="../../../../categories/language-reference/">language-reference</a>
		    <span>  </span>
		<a href="../../../../categories/lisp/">lisp</a>
		    <span>  </span>
		<a href="../../../../categories/projectlisp-bibliography/">project:lisp-bibliography</a>
	</div>
    </div>

	<!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
	    <a href="../common-lisp-the-language/" rel="prev">
		<span class="meta-nav">Older Post</span>Common Lisp: the language
	    </a>
	</div>
	<div class="next">
	    <a href="../lispcraft/" rel="next">
		<span class="meta-nav">Newer Post</span>LISPcraft
	    </a>
	</div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><script src="../../../../assets/js/mastodon-share.js"></script><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>